#Не знаю, как там в Лондоне, я не была. Может, там собака — друг человека. А у нас управдом — друг человека!
source_string='Не знаю, как там в Лондоне, я не была. Может, там собака — друг человека. А у нас управдом — друг человека!'

print('1)Колличество символов:\n',len(source_string))
print('2)Revers string:\n',source_string[::-1])
print('3)Каждое слово с большой буквы:\n',source_string.title())
print('4)Весь текст просисными буквами:\n',source_string.upper())
print('5)Число вхождений "нд", "ам", "о" в строку\n',source_string.find('нд'),source_string.find('ам'),source_string.find('о'))
print('6)Заглане<->строчные:\n',source_string.swapcase())
print('7)Исходная строка:\n',source_string)
print('8)Удалить пробелы\n',source_string.replace(' ','_'))
print('8)Чо будет 😆\n',source_string.count('нд'),source_string.count('ам'),source_string.count('о'))

#first_version_lab
#for githab